[
    {
      "title": "Cape Coast Castle, Ghana",
      "description": "Visit the historical Cape Coast Castle by booking online through the Ghana Museums and Monuments Board website or via tour companies offering guided trips from Accra or Takoradi."
    },
    {
      "title": "Olumo Rock, Nigeria",
      "description": "Book a guided tour to Olumo Rock through local tour agencies or walk-in at the entrance. Online booking is available through NigeriaTourism.ng or local travel apps."
    },
    {
      "title": "Pendjari National Park, Benin",
      "description": "To book a wildlife safari in Pendjari National Park, contact Benin National Parks Authority or international platforms like Viator and TripAdvisor for complete packages."
    },
    {
      "title": "Lake Retba (Lac Rose), Senegal",
      "description": "Book a boat ride and guided visit through local travel agencies in Dakar or directly at the lake. Airbnb Experiences and GetYourGuide also offer packages."
    },
    {
      "title": "Grand-Bassam Beach, Ivory Coast",
      "description": "Reserve beachfront stays and activities via booking platforms like Booking.com or Expedia. Some hotels offer custom packages that include guided city tours."
    },
    {
      "title": "Ouidah Voodoo Festival, Benin",
      "description": "Book festival tours through Benin cultural tourism sites or African Roots Travel. Tours include accommodation, guides, and cultural immersion activities."
    },
    {
      "title": "Kakum National Park, Ghana",
      "description": "Book a canopy walk tour in advance through the Kakum National Park office or licensed tour companies. Group tours from Accra are also available with transportation."
    },
    {
      "title": "Abidjan City Tour, Ivory Coast",
      "description": "Book city tours online through TripAdvisor, Airbnb Experiences, or local operators. Most packages include transportation, English-speaking guides, and meals."
    },
    {
      "title": "Gorée Island, Senegal",
      "description": "Ferries to Gorée Island depart from Dakar port. Tickets can be purchased on-site or booked as part of a guided tour. Includes museum access and historical site visits."
    },
    {
      "title": "Zuma Rock, Nigeria",
      "description": "Tourists can book through Abuja-based travel agencies. Some hiking tours are available through local adventure groups and hotel concierge services."
    }
  ]
  